configuration.org
#+TITLE: My literate configurations with Org and Nix
#+STARTUP: overview
#+PROPERTY: header-args:nix :mkdirp yes :noweb tangle
#+OPTIONS: ^:{} tags:nil

* About                                                              :readme:

This repository manages system configurations for multiple machines using
[[https://nixos.org/][Nix]] and [[https://orgmode.org/][Org mode]]. All configuration is written as literate
programs—Org documents where prose explains the reasoning behind each decision,
and Nix code blocks are tangled into the actual configuration files.

** Documentation

The full configuration document is published at:

- English: https://natsukium.github.io/dotfiles/
- Japanese: https://natsukium.github.io/dotfiles/ja/

** Nix

[[https://nixos.org/][Nix]] is a purely functional package manager and build system. This repository
uses several Nix ecosystem tools:

- [[https://wiki.nixos.org/wiki/Flakes][Flakes]] for reproducible dependency management
- [[https://nixos.org/][NixOS]] for declarative Linux system configuration
- [[https://github.com/nix-darwin/nix-darwin][nix-darwin]] for declarative macOS system configuration
- [[https://github.com/nix-community/home-manager][home-manager]] for user environment management
- [[https://github.com/nix-community/nix-on-droid][nix-on-droid]] for Android (Termux) environment

** Machines

| Name        | Platform        | Device               | Role            |
|-------------+-----------------+----------------------+-----------------|
| kilimanjaro | NixOS (x86_64)  | i5-12400F / RTX 3080 | Main desktop    |
| tarangire   | NixOS (x86_64)  | Ryzen 9 9950X        | Build server    |
| manyara     | NixOS (x86_64)  | Beelink Mini S12     | Home server     |
| arusha      | NixOS (x86_64)  | WSL2                 | WSL environment |
| serengeti   | NixOS (aarch64) | OCI A1 Flex          | Build server    |
| katavi      | macOS (aarch64) | M1 MacBook Air       | Main laptop     |
| work        | macOS (aarch64) | M4 MacBook Pro       | Work laptop     |
| mikumi      | macOS (aarch64) | M1 Mac mini          | Build server    |
| android     | nix-on-droid    | Galaxy S24 FE        | Phone           |

* Philosophy                                                         :readme:
:PROPERTIES:
:EXPORT_FILE_NAME: CLAUDE
:EXPORT_OPTIONS: toc:nil
:END:

** Literate Configuration

Nix is declarative. Reading a Nix expression reveals what the system should become,
and Nix itself handles how to get there. But neither the code nor the build system
captures why a particular configuration exists, or why alternatives were rejected.

Why was fish chosen over zsh or bash? Why does the desktop profile enable this
specific set of services? Why was a particular package pinned to an older version?
The code shows the decision, but not the reasoning behind it.
Without this context, future changes risk undoing intentional tradeoffs or
repeating previously rejected approaches.

This repository uses literate programming to preserve intent. Configuration lives
in Org mode documents where prose surrounds code.

For most settings, one or two sentences—what it enables and the visible
effect—is enough. Reserve the full problem-and-alternatives form for non-obvious
trade-offs: architectural choices, package pins, temporary workarounds.

* Configuration

** Flake

This flake manages NixOS, nix-darwin, and home-manager configurations for multiple machines
across different platforms (macOS, Linux, Android). It uses flake-parts for modular organization
and includes tooling for development, code formatting, and pre-commit hooks.

#+begin_src nix :tangle flake.nix :exports none
# This file is auto-generated from configuration.org.
# Do not edit directly.
#+end_src

#+begin_src nix :tangle flake.nix
{
  description = "dotfiles";

  inputs = {
    # Core
    <<nixpkgs>>
    <<nixpkgs-stable>>
    # Flake Infrastructure
    <<flake-parts>>
    # Transitive Dependencies
    <<flake-utils>>
    # System Configuration
    <<darwin>>
    <<home-manager>>
    <<nixos-wsl>>
    <<nix-on-droid>>
    <<disko>>
    <<impermanence>>
    <<lanzaboote>>
    <<nixos-facter-modules>>
    # Infrastructure
    <<comin>>
    <<microvm>>
    <<niks3>>
    <<sops-nix>>
    <<tsnsrv>>
    # Development Tools
    <<git-hooks>>
    <<treefmt-nix>>
    # Desktop & Theming
    <<nix-colors>>
    <<nix-wallpaper>>
    # Applications
    <<brew-nix>>
    <<claude-desktop>>
    <<edgepkgs>>
    <<emacs-overlay>>
    <<felis>>
    <<firefox-addons>>
    <<hermes-agent>>
    <<mcp-servers>>
    <<niri-flake>>
    <<org-clickup>>
    <<nur-packages>>
    <<paneru>>
    <<simple-wol-manager>>
    <<spoor>>
    <<vicinae>>
    <<zen-browser>>
  };

  nixConfig = {
    <<nix-config>>
  };

  outputs =
    { self, flake-parts, ... }@inputs:
    flake-parts.lib.mkFlake { inherit inputs; } {
      <<outputs>>
    };
}
#+end_src

*** Inputs

External flake dependencies.

To minimize evaluation time caused by dependency graph bloat, almost all flakes are configured
to follow the same nixpkgs and other common inputs wherever possible.

**** Core

***** nixpkgs

https://github.com/NixOS/nixpkgs

#+BEGIN_QUOTE
Nix Packages collection & NixOS
#+END_QUOTE

The primary package set. Using =nixos-unstable-small= instead of =nixos-unstable= for faster
channel updates. The =-small= variant skips some less critical CI tests, allowing new package
versions to propagate faster while maintaining stability for core packages.

For channel selection guidance, see https://nix.dev/concepts/faq.html#which-channel-branch-should-i-use

Channel status can be checked at https://status.nixos.org/

Using =git+https://= with =shallow=1= instead of =github:= for slightly faster file extraction
on large repositories like nixpkgs.

#+NAME: nixpkgs
#+begin_src nix
nixpkgs.url = "git+https://github.com/nixos/nixpkgs?shallow=1&ref=nixos-unstable-small";
#+end_src

***** nixpkgs-stable

Provides stable packages when unstable has build failures or regressions. Mainly used by the
=stable= overlay (see [[file:overlays/configuration.org][overlays/configuration.org]]) for packages that are broken in unstable.

#+NAME: nixpkgs-stable
#+begin_src nix
nixpkgs-stable.url = "git+https://github.com/nixos/nixpkgs?shallow=1&ref=nixos-25.05";
#+end_src

**** Flake Infrastructure

***** flake-parts

https://github.com/hercules-ci/flake-parts

#+BEGIN_QUOTE
Simplify Nix Flakes with the module system
#+END_QUOTE

Framework for organizing flake outputs. Provides module system for flakes,
making complex configurations more maintainable through separation of concerns.

#+NAME: flake-parts
#+begin_src nix
flake-parts = {
  url = "github:hercules-ci/flake-parts";
  inputs.nixpkgs-lib.follows = "nixpkgs";
};
#+end_src

**** Transitive Dependencies

***** flake-utils

https://github.com/numtide/flake-utils

#+BEGIN_QUOTE
Pure Nix flake utility functions
#+END_QUOTE

Common flake utilities. Only used transitively via =follows= to unify the
flake-utils version across inputs that depend on it.

#+NAME: flake-utils
#+begin_src nix
flake-utils.url = "github:numtide/flake-utils";
#+end_src

**** System Configuration

***** darwin

https://github.com/nix-darwin/nix-darwin

#+BEGIN_QUOTE
Manage your macOS using Nix
#+END_QUOTE

nix-darwin provides NixOS-style system configuration for macOS. Essential for managing
macOS system settings, launchd services, and Homebrew declaratively.

#+NAME: darwin
#+begin_src nix
darwin = {
  url = "github:nix-darwin/nix-darwin";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** home-manager

https://github.com/nix-community/home-manager

#+BEGIN_QUOTE
Manage a user environment using Nix
#+END_QUOTE

User environment management. Manages dotfiles, user services, and per-user packages
declaratively. The backbone of user-level configuration in this repository.

#+NAME: home-manager
#+begin_src nix
home-manager = {
  url = "github:nix-community/home-manager";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** nixos-wsl

https://github.com/nix-community/nixos-wsl

#+BEGIN_QUOTE
NixOS on WSL
#+END_QUOTE

NixOS on Windows Subsystem for Linux. Provides NixOS experience within WSL2,
useful for Windows machines that need Linux development environments.

#+NAME: nixos-wsl
#+begin_src nix
nixos-wsl = {
  url = "github:nix-community/nixos-wsl";
  inputs.flake-compat.follows = "";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** nix-on-droid

https://github.com/nix-community/nix-on-droid

#+BEGIN_QUOTE
Nix-enabled environment for your Android device.
#+END_QUOTE

Nix environment for Android via Termux. Enables the same declarative configuration
approach on mobile devices.

#+NAME: nix-on-droid
#+begin_src nix
nix-on-droid = {
  url = "github:nix-community/nix-on-droid";
  inputs.home-manager.follows = "home-manager";
  inputs.nix-formatter-pack.follows = "";
  inputs.nixpkgs-docs.follows = "nixpkgs";
  inputs.nixpkgs-for-bootstrap.follows = "nixpkgs";
  inputs.nixpkgs.follows = "nixpkgs";
  inputs.nmd.follows = "";
};
#+end_src

***** disko

https://github.com/nix-community/disko

#+BEGIN_QUOTE
Declarative disk partitioning and formatting using nix
#+END_QUOTE

Used for reproducible NixOS installations with automated partition layout, filesystem
creation, and encryption setup.

#+NAME: disko
#+begin_src nix
disko = {
  url = "github:nix-community/disko";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** impermanence

https://github.com/nix-community/impermanence

#+BEGIN_QUOTE
Modules to help you handle persistent state on systems with ephemeral root storage
#+END_QUOTE

Manages stateful paths on systems with ephemeral root filesystems. Used with btrfs
snapshots to ensure only explicitly declared state persists across reboots.

#+NAME: impermanence
#+begin_src nix
impermanence.url = "github:nix-community/impermanence";
#+end_src

***** lanzaboote

https://github.com/nix-community/lanzaboote

#+BEGIN_QUOTE
Secure Boot for NixOS
#+END_QUOTE

Signs boot components with custom keys, enabling Secure Boot on NixOS machines.

#+NAME: lanzaboote
#+begin_src nix
lanzaboote = {
  url = "github:nix-community/lanzaboote";
  inputs.nixpkgs.follows = "nixpkgs";
  inputs.pre-commit.follows = "git-hooks";
};
#+end_src

***** nixos-facter-modules

https://github.com/numtide/nixos-facter-modules

#+BEGIN_QUOTE
A series of NixOS modules to be used in conjunction with nixos-facter
#+END_QUOTE

Hardware detection for NixOS. Automatically generates hardware configuration
based on detected hardware, simplifying initial system setup.

#+NAME: nixos-facter-modules
#+begin_src nix
nixos-facter-modules.url = "github:numtide/nixos-facter-modules";
#+end_src

**** Infrastructure

***** comin

https://github.com/nlewo/comin

#+BEGIN_QUOTE
GitOps For NixOS Machines
#+END_QUOTE

Automatically deploys configuration changes when pushed to the repository,
enabling continuous deployment for servers without manual =nixos-rebuild switch=.

#+NAME: comin
#+begin_src nix
comin = {
  url = "github:nlewo/comin";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** microvm

https://github.com/astro/microvm.nix

#+BEGIN_QUOTE
NixOS modules for declaring & running virtual machines from within your system Flake configuration
#+END_QUOTE

Lightweight per-VM isolation suitable for running somewhat untrusted code.
Used to sandbox third-party agent code (hermes-agent) so crashes, runaway
tool invocations, or compromise of the agent runtime cannot reach the host's
service stack. A microvm is preferred over a plain systemd-nspawn container
because the qemu/firecracker boundary blocks kernel-level escapes that
container namespacing alone does not.

#+NAME: microvm
#+begin_src nix
microvm = {
  url = "github:astro/microvm.nix";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** sops-nix

https://github.com/Mic92/sops-nix

#+BEGIN_QUOTE
Atomic secret provisioning for NixOS based on sops
#+END_QUOTE

Secrets management using Mozilla SOPS. Encrypts secrets in the repository
that are decrypted at activation time using age keys.

#+NAME: sops-nix
#+begin_src nix
sops-nix = {
  url = "github:Mic92/sops-nix";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** tsnsrv

https://github.com/boinkor-net/tsnsrv

#+BEGIN_QUOTE
A reverse proxy that exposes services on your tailnet (as their own tailscale participants)
#+END_QUOTE

Tailscale service proxy. Exposes local services to the Tailscale network with
automatic HTTPS certificates.

#+NAME: tsnsrv
#+begin_src nix
tsnsrv = {
  url = "github:boinkor-net/tsnsrv";
  inputs.flake-parts.follows = "flake-parts";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** niks3

https://github.com/Mic92/niks3

#+BEGIN_QUOTE
S3-backed Nix binary cache with garbage collection
#+END_QUOTE

niks3 is a self-hosted, S3-backed Nix binary cache that resolves the upload
limits I ran into with the alternatives: it hands clients presigned S3 URLs so
NARs upload straight to R2, and the cloudflared tunnel only carries small API
calls. Cachix's free 5 GB was not enough for my dotfiles closures, so builds kept
re-running instead of being fetched from the cache. attic worked, but behind a
free cloudflared tunnel every upload was proxied through the tunnel and hit
Cloudflare's 100 MiB request-body cap on large derivations.

#+NAME: niks3
#+begin_src nix
niks3 = {
  url = "github:Mic92/niks3";
  inputs.nixpkgs.follows = "nixpkgs";
  inputs.treefmt-nix.follows = "treefmt-nix";
};
#+end_src

**** Development Tools

***** git-hooks

https://github.com/cachix/git-hooks.nix

#+BEGIN_QUOTE
Seamless integration of pre-commit.com git hooks with Nix.
#+END_QUOTE

Pre-commit hooks as Nix derivations. Ensures code quality checks run consistently
across all development environments without requiring global tool installation.

Inputs that don't affect this flake are removed to prevent lockfile bloat.

#+NAME: git-hooks
#+begin_src nix
git-hooks = {
  url = "github:cachix/git-hooks.nix";
  inputs.flake-compat.follows = "";
  inputs.gitignore.follows = "";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

***** treefmt-nix

https://github.com/numtide/treefmt-nix

#+BEGIN_QUOTE
treefmt nix configuration
#+END_QUOTE

Unified code formatter configuration. Runs multiple formatters (oxfmt, nixfmt, shfmt, etc.)
through a single interface, ensuring consistent formatting across the repository.

#+NAME: treefmt-nix
#+begin_src nix
treefmt-nix = {
  url = "github:numtide/treefmt-nix";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

**** Desktop & Theming

***** nix-colors

https://github.com/misterio77/nix-colors

#+BEGIN_QUOTE
Modules and schemes to make theming with Nix awesome.
#+END_QUOTE

Base16 color scheme framework for Nix. Provides consistent theming across
applications through a single color scheme definition.

#+NAME: nix-colors
#+begin_src nix
nix-colors = {
  url = "github:misterio77/nix-colors";
  inputs.nixpkgs-lib.follows = "nixpkgs";
};
#+end_src

***** nix-wallpaper

https://github.com/natsukium/nix-wallpaper

#+BEGIN_QUOTE
A configurable wallpaper for nix systems
#+END_QUOTE

Generates Nix logo wallpapers. Using a custom branch (=custom-logo=) that supports
additional logo variants.

#+NAME: nix-wallpaper
#+begin_src nix
nix-wallpaper = {
  url = "github:natsukium/nix-wallpaper/custom-logo";
  inputs.flake-utils.follows = "flake-utils";
  inputs.nixpkgs.follows = "nixpkgs";
  inputs.pre-commit-hooks.follows = "git-hooks";
};
#+end_src

**** Applications

